export const tagTypes = new Map([
  [1, "语法标记"],
  [2, "选择标记"]
]);

export const productHierarchys = new Map([
  [1, "硬件层"],
  [2, "系统层"],
  [3, "支撑层"],
  [4, "服务层"],
  [5, "应用层"]
]);

export const operators = new Map([
  [1, "与（&&）"],
  [2, "或（||）"],
  [3, "非（!）"]
]);

export const types = new Map([
  [1, "IP地址"],
  [2, "端口"],
  [3, "服务"],
  [4, "设备厂商"],
  [5, "设备/软件型号"],
  [6, "起止时间"],
  [7, "组件名"],
  [8, "操作系统"],
  [9, "协议"],
  [10, "设备类型"],
  [11, "固件/软件版本"],
  [12, "涉及领域"],
  [13, "地址范围"],
  [14, "是否含有漏洞"]
]);
